# 3. 데이터 선택 및 조작하기

In [115]:
import pandas as pd

In [116]:
dict_list = {
    'Name' : ['Baek','Kim','Park','Han','Lee'],
    'Age' : [21,31,17,41,51],
    'Gender' : ['M','F','F','M','M'],
    'is_student' : [True, False, True, False, False]
}

df = pd.DataFrame(dict_list)
print(df)

   Name  Age Gender  is_student
0  Baek   21      M        True
1   Kim   31      F       False
2  Park   17      F        True
3   Han   41      M       False
4   Lee   51      M       False

## DataFrame의 size, shape, ndim

```python
df.size # DataFrame 내의 총 데이터 개수 (row * column)
df.shape # (row수, column수)
df.ndim # 데이터의 차원
```

### Example

In [117]:
print(df.size)
print(df.shape)
print(df.ndim)

20
(5, 4)
2

---
## 3.1. 데이터 선택하기

기본 문법

```python
series[index] # index에 위치한 값을 반환
dataframe[colname] # colname에 해당하는 column을 반환
dataframe[start:end] # start~end 의 index에 해당하는 row를 반환

dataframe.loc[index, [colname]] # index, colname의 범위에 해당하는 DataFrame을 반환
dataframe.iloc[row number, [col number]] # row number, col number의 범위에 해당하는 DataFrame을 반환
```
#### 주의 : loc 함수는 index와 column명을 통해 접근하며, iloc함수는 row와 column의 위치를 통해 접근한다


### Example

In [118]:
# []를 이용하여 특정 Column 선택
# 리턴값의 type은 Series

result = df['Name'] # 혹은 df.노선명
#result = df.loc[:,'Name']
#result = df.iloc[:,0]
print(result, '\n')
print(type(result))

0    Baek
1     Kim
2    Park
3     Han
4     Lee
Name: Name, dtype: object

<class 'pandas.core.series.Series'>

In [119]:
# []를 이용하여 특정 Row 선택
# 리턴값의 type은 ???

result = df[1:3] # 첫번째, 두번째 Row 선택
#result = df.loc[1:2]
#result = df.iloc[1:3]
print(result, '\n')
print(type(result))

   Name  Age Gender  is_student
1   Kim   31      F       False
2  Park   17      F        True

<class 'pandas.core.frame.DataFrame'>

In [120]:
# Series의 특정 값을 선택
s = df['Gender']
print(s[2])
print(s.loc[2])
print(s.iloc[2])

# 한 번에 하려면?
print(df['Gender'][2])
print(df['Gender'].loc[2])
print(df['Gender'].iloc[2])

F
F
F
F
F
F

In [121]:
#여러 Column 선택하기

result = df[['Name','Age','Gender']]
#result = df.loc[:,['Name','Age','Gender']]
#result = df.iloc[:,[0,1,2]]

#result = df[['Name':'Gender']] #Error
#result = df.loc[:,'Name':'Gender']
#result = df.iloc[:,0:3]
print(result, '\n')

   Name  Age Gender
0  Baek   21      M
1   Kim   31      F
2  Park   17      F
3   Han   41      M
4   Lee   51      M

In [122]:
# 특정 Column, Row만 선택하려면?
result = df[['Name','Gender']][1:3]
#result = df.loc[1:2,['Name','Gender']]
#result = df.iloc[1:3,[0,2]]
print(result)

   Name Gender
1   Kim      F
2  Park      F

---
## 3.2 DataFrame의 Column을 추가,변경,삭제하기

### Column 추가

기본 문법

```python
dataframe[colname] = data
```
이때, `data` 에는 
 - Series, 리스트, 딕셔너리, 튜플 등의 1차원 데이터
 - 혹은 숫자, 문자열 등의 스칼라 값
이 들어갈 수 있다

#### Example

In [123]:
# 1차원 데이터를 이용하여 Weight 컬럼을 DataFrame에 추가
df['Weight'] = [50,55,60,65,70]
#df['Weight'] = (50,55,60,65,70)
#df['Weight'] = pd.Series([50,55,60,65,70])
#df['Weight'] = {
#    0: 50,
#    1: 55,
#    2: 60,
#    3: 65,
#    4: 70
#}

print(df)

   Name  Age Gender  is_student  Weight
0  Baek   21      M        True      50
1   Kim   31      F       False      55
2  Park   17      F        True      60
3   Han   41      M       False      65
4   Lee   51      M       False      70

In [124]:
# 1차원 데이터를 이용하여 Height 컬럼을 DataFrame에 추가
df['Height'] = [160,170,180,175,165]

print(df)

   Name  Age Gender  is_student  Weight  Height
0  Baek   21      M        True      50     160
1   Kim   31      F       False      55     170
2  Park   17      F        True      60     180
3   Han   41      M       False      65     175
4   Lee   51      M       False      70     165

In [125]:
# 두개의 Column 값을 사용하여, BMI 컬럼을 DataFrame에 추가
df['BMI'] = df['Weight'] / (df['Height'] / 100) ** 2

print(df)

   Name  Age Gender  is_student  Weight  Height        BMI
0  Baek   21      M        True      50     160  19.531250
1   Kim   31      F       False      55     170  19.031142
2  Park   17      F        True      60     180  18.518519
3   Han   41      M       False      65     175  21.224490
4   Lee   51      M       False      70     165  25.711662

In [126]:
# BMI가 20이 넘는 사람은 True, 20 미만인 사람은 False를 값으로 갖는 'Need_Diet' 컬럼 추가
df['Need_Diet'] = df['BMI'] > 20

print(df)

   Name  Age Gender  is_student  Weight  Height        BMI  Need_Diet
0  Baek   21      M        True      50     160  19.531250      False
1   Kim   31      F       False      55     170  19.031142      False
2  Park   17      F        True      60     180  18.518519      False
3   Han   41      M       False      65     175  21.224490       True
4   Lee   51      M       False      70     165  25.711662       True

In [127]:
# 스칼라 값을 이용하여 Country 컬럼을 DataFrame에 추가
df['Country'] = 'Korea'
print(df)

   Name  Age Gender  is_student  Weight  Height        BMI  Need_Diet Country
0  Baek   21      M        True      50     160  19.531250      False   Korea
1   Kim   31      F       False      55     170  19.031142      False   Korea
2  Park   17      F        True      60     180  18.518519      False   Korea
3   Han   41      M       False      65     175  21.224490       True   Korea
4   Lee   51      M       False      70     165  25.711662       True   Korea

### Column 삭제


기본 문법

```python
del dataframe[colname]
dataframe.pop(colname)
```

In [128]:
# del 을 이용하여 Weight 컬럼 삭제
del df['Weight']
print(df)

   Name  Age Gender  is_student  Height        BMI  Need_Diet Country
0  Baek   21      M        True     160  19.531250      False   Korea
1   Kim   31      F       False     170  19.031142      False   Korea
2  Park   17      F        True     180  18.518519      False   Korea
3   Han   41      M       False     175  21.224490       True   Korea
4   Lee   51      M       False     165  25.711662       True   Korea

In [129]:
# pop을 이용하여 Height 컬럼 삭제
# s 변수에 지워진 Height 컬럼이 할당된다
s = df.pop('Height')
print(df, '\n')
print(s)

   Name  Age Gender  is_student        BMI  Need_Diet Country
0  Baek   21      M        True  19.531250      False   Korea
1   Kim   31      F       False  19.031142      False   Korea
2  Park   17      F        True  18.518519      False   Korea
3   Han   41      M       False  21.224490       True   Korea
4   Lee   51      M       False  25.711662       True   Korea

0    160
1    170
2    180
3    175
4    165
Name: Height, dtype: int64

### apply 함수

기본 문법

```python
dataframe.apply(function, axis=0)
```

이때, `function` 에는 (람다)함수가 들어갈 수 있다.

axis가 0일땐 `function` 에 column 단위로 데이터가 전달되고,

axis가 1일땐 `function` 에 row 단위로 데이터가 전달된다.




//TODO : Axis 그림 추가


#### Example
새로운 계산법을 적용하여 Need_Diet 컬럼 내용을 변경
새로운 계산법 : 
 - Age가 30 이상이면 BMI에 1.1을 곱하고
 - Gender가 M 이라면 다시 결과값에 1.1을 곱한다
 - 최종 결과값이 20 이상이라면 Need_Diet를 True로 설정, 아니라면 False로 설정

In [130]:
def myfunc(x):
    result = x['BMI']
    
    if x['Age'] >= 30 :
        result *= 1.1
    if x['Gender'] == 'M' :
        result *= 1.1
    
    if result >= 20 :
        return True
    else :
        return False

df['Need_Diet'] = df.apply(myfunc, axis=1)
print(df)

   Name  Age Gender  is_student        BMI  Need_Diet Country
0  Baek   21      M        True  19.531250       True   Korea
1   Kim   31      F       False  19.031142       True   Korea
2  Park   17      F        True  18.518519      False   Korea
3   Han   41      M       False  21.224490       True   Korea
4   Lee   51      M       False  25.711662       True   Korea

### DataFrame 합치기 (Concatenate)


 - concat 함수는 두개 이상의 DataFrame을 단순히 합친다.
 - 비슷한 동작을 하는 함수로는 merge, join함수가 있으며, 2일차 강의에 다룰 예정


기본 문법

```python
pd.concat([list of DataFrame], axis=0)
```

#### Example

In [131]:
# DataFrame을 세로축으로 나누고, 다시 합하기
df1 = df.loc[:,:'is_student']
df2 = df.loc[:,'BMI':]

print(df1)
print(df2)

df3 = pd.concat([df1,df2], axis=1)

print(df3)

   Name  Age Gender  is_student
0  Baek   21      M        True
1   Kim   31      F       False
2  Park   17      F        True
3   Han   41      M       False
4   Lee   51      M       False
         BMI  Need_Diet Country
0  19.531250       True   Korea
1  19.031142       True   Korea
2  18.518519      False   Korea
3  21.224490       True   Korea
4  25.711662       True   Korea
   Name  Age Gender  is_student        BMI  Need_Diet Country
0  Baek   21      M        True  19.531250       True   Korea
1   Kim   31      F       False  19.031142       True   Korea
2  Park   17      F        True  18.518519      False   Korea
3   Han   41      M       False  21.224490       True   Korea
4   Lee   51      M       False  25.711662       True   Korea

In [132]:
# DataFrame을 가로축으로 나누고, 다시 합하기
df1 = df.loc[:2]
df2 = df.loc[3:]

print(df1)
print(df2)

df3 = pd.concat([df1,df2], axis=0)

print(df3)

   Name  Age Gender  is_student        BMI  Need_Diet Country
0  Baek   21      M        True  19.531250       True   Korea
1   Kim   31      F       False  19.031142       True   Korea
2  Park   17      F        True  18.518519      False   Korea
  Name  Age Gender  is_student        BMI  Need_Diet Country
3  Han   41      M       False  21.224490       True   Korea
4  Lee   51      M       False  25.711662       True   Korea
   Name  Age Gender  is_student        BMI  Need_Diet Country
0  Baek   21      M        True  19.531250       True   Korea
1   Kim   31      F       False  19.031142       True   Korea
2  Park   17      F        True  18.518519      False   Korea
3   Han   41      M       False  21.224490       True   Korea
4   Lee   51      M       False  25.711662       True   Korea

In [133]:
# Index가 겹칠 경우
df3 = pd.concat([df,df], axis=0)
print(df3)

   Name  Age Gender  is_student        BMI  Need_Diet Country
0  Baek   21      M        True  19.531250       True   Korea
1   Kim   31      F       False  19.031142       True   Korea
2  Park   17      F        True  18.518519      False   Korea
3   Han   41      M       False  21.224490       True   Korea
4   Lee   51      M       False  25.711662       True   Korea
0  Baek   21      M        True  19.531250       True   Korea
1   Kim   31      F       False  19.031142       True   Korea
2  Park   17      F        True  18.518519      False   Korea
3   Han   41      M       False  21.224490       True   Korea
4   Lee   51      M       False  25.711662       True   Korea

In [134]:
df3 = pd.concat([df,df], axis=0, ignore_index=True)
print(df3)

   Name  Age Gender  is_student        BMI  Need_Diet Country
0  Baek   21      M        True  19.531250       True   Korea
1   Kim   31      F       False  19.031142       True   Korea
2  Park   17      F        True  18.518519      False   Korea
3   Han   41      M       False  21.224490       True   Korea
4   Lee   51      M       False  25.711662       True   Korea
5  Baek   21      M        True  19.531250       True   Korea
6   Kim   31      F       False  19.031142       True   Korea
7  Park   17      F        True  18.518519      False   Korea
8   Han   41      M       False  21.224490       True   Korea
9   Lee   51      M       False  25.711662       True   Korea

### head와 tail 함수

 - head함수는 DataFrame의 첫 n행을 출력
 - tail함수는 DataFrame의 마지막 n행을 출력


기본 문법

```python
df.head(number=5)
df.tail(number=5)
```

#### Example

In [135]:
#첫 5행 출력
df3.head()

   Name  Age Gender  is_student        BMI  Need_Diet Country
0  Baek   21      M        True  19.531250       True   Korea
1   Kim   31      F       False  19.031142       True   Korea
2  Park   17      F        True  18.518519      False   Korea
3   Han   41      M       False  21.224490       True   Korea
4   Lee   51      M       False  25.711662       True   Korea

In [136]:
#마지막 5행 출력
df3.tail()

   Name  Age Gender  is_student        BMI  Need_Diet Country
5  Baek   21      M        True  19.531250       True   Korea
6   Kim   31      F       False  19.031142       True   Korea
7  Park   17      F        True  18.518519      False   Korea
8   Han   41      M       False  21.224490       True   Korea
9   Lee   51      M       False  25.711662       True   Korea

In [137]:
#첫 3행 출력
df3.head(3)

   Name  Age Gender  is_student        BMI  Need_Diet Country
0  Baek   21      M        True  19.531250       True   Korea
1   Kim   31      F       False  19.031142       True   Korea
2  Park   17      F        True  18.518519      False   Korea

In [138]:
#마지막 행을 제외하고 모두 출력
df3.head(-1)

   Name  Age Gender  is_student        BMI  Need_Diet Country
0  Baek   21      M        True  19.531250       True   Korea
1   Kim   31      F       False  19.031142       True   Korea
2  Park   17      F        True  18.518519      False   Korea
3   Han   41      M       False  21.224490       True   Korea
4   Lee   51      M       False  25.711662       True   Korea
5  Baek   21      M        True  19.531250       True   Korea
6   Kim   31      F       False  19.031142       True   Korea
7  Park   17      F        True  18.518519      False   Korea
8   Han   41      M       False  21.224490       True   Korea